/* --- main.cpp ------------------------------------------------------------------------------------------- **
 *  Исходим из того, что лифты, в зависимости от предназначения
 *  могут иметь различный диапазон охвата этажей, например:
 *  от -3 до 6, от 2 до 18 и т.д.
 *	Таким образом нижний этаж мы задаем в диапазоне от -99 до 98,
 *	а верхний в диапазоне от введенного нижнего плюс один до 99
 *	Данные ограничения заданы соответствующими определениями в файле "lift.h"
 *	Команды, имитирующие управление лифтом:
 *	Fxx - вызов лифта на xx-этаже
 *	Cyy - нажатие кнопки yy-этажа в лифте
 *	X	- выход из программы
 * -------------------------------------------------------------------------------------------------------- */
#include <cstdio>
#include <cstdlib>
#include <string.h>
#include "main.h"
#include "ClassLift.h"
#include "MyStr.h"

/* -------------------------------------------------------------------------------------------------------- **
 * Название :  main
 * Описание :  
 * Параметры:  Нет
 * Результат:  
 * -------------------------------------------------------------------------------------------------------- */
int main()
{
TLift *Lift;
int Min = 0, Max = 0;
char InStr[20];
TLiftCmd Cmd;
int Floor;

  printf(StrInitialData);
  Min = InputNumData( MinFloor, MaxFloor-1, StrEntLowFl);
  Max = InputNumData( Min+1, MaxFloor, StrEntHighFl);

  Lift = new TLift(Min,Max);
  
  Lift->ShowInfo();  

  printf(StrStart);
  
  for (;;)
  { printf(">>");
    scanf ("%20s", InStr);
    if ( DecodeCmd(InStr, &Cmd, &Floor) )
    { switch( Cmd )
      { case CmdExit:   	// Выход из программы
          delete Lift;	
          return(0);
      	case CmdCabinCall:  // Нажал кнопку этажа
      	  Lift->AddCabinCall(Floor);
      	  break;
      	case CmdFloorCall:   // Вызвал лифт с этажа
      	  Lift->AddFloorCall(Floor);
      	  break;
	  }
	}
	else
  	  printf(StrErrCmd);
    Lift->Action();
  }
}

/* -------------------------------------------------------------------------------------------------------- **
 * Название :  InputNumData
 * Описание :  Ввод числового значения в диапазоне от Min до Max включительно
 *             Функция завершится только когда введеное число попадет в задаваемый дипазон
 * Параметры:  Min и Max минимальное и максимальное значение вводимого числа
 * Результат:  Введеное число
 * -------------------------------------------------------------------------------------------------------- */
int InputNumData(int Min, int Max, const char *Str)
{
int Num;
  do
  { printf("%s(%d..%d):", Str, Min, Max);
    scanf ("%d", &Num);
  } while ( (Num < Min) || (Num > Max) );
  return (Num);
}	

/* -------------------------------------------------------------------------------------------------------- **
 * Название :  DecodeCmd
 * Описание :  Декодирует входную строку Str и результат помещает в Cmd и Flr
 * Параметры:  Str - указатель на строку
 *             Cmd - указатель на команду
 *             Flr - указатель на этаж
 * Результат:  true - при удачном декодировании
 * -------------------------------------------------------------------------------------------------------- */
bool DecodeCmd(char *Str, TLiftCmd *Cmd, int *Flr)
{
  switch (Str[0])
  { 
    case 'X':  // Выход из программы
  	  if (strlen(Str) == 1)
  	  { *Cmd = CmdExit;
	    return(true);
      }
      break;
      case 'C':    // Нажата кнопка этажа
  	  if (strlen(Str) > 1)
  	  { *Cmd = CmdCabinCall;
	    *Flr = atoi(Str+1);
	    return(true);
      }
      break;
    case 'F':  // Вызов лифта на этаже
  	  if (strlen(Str) > 1)
  	  { *Cmd = CmdFloorCall;
	    *Flr = atoi(Str+1);
	    return(true);
      }
      break;
  }
  return(false);
}
/* --------------------------------------------( end of file )--------------------------------------------- */

